app/controllers/photos_controller.rb

  def delete
    photo = Photo.find(params[:id])
    photo.destroy
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 8)
DELETE FROM `photos` WHERE `id` = 8

  def create
    puts params.inspect
    photo = Photo.new(params[:photo])
    photo.save!
---
INSERT INTO `photos` (`attach_file_name`, `attach_file_size`, `created_at`, `updated_at`, `attach_content_type`, `attach_updated_at`, `photographer_id`, `description`) VALUES('False clown anemonefish.jpg', 1858724, '2011-02-23 14:58:31', '2011-02-23 14:58:31', 'image/jpeg', '2011-02-23 14:58:27', 4, 'test only')