app/controllers/photographers_controller.rb

  def create
    photographer = Photographer.new(params[:photographer])
    photographer.save!
---
INSERT INTO `photographers` (`created_at`, `updated_at`, `lastname`, `firstname`) VALUES('2011-02-23 14:55:01', '2011-02-23 14:55:01', 'admin101', 'admin')