app/controllers/viewers_controller.rb

SELECT * FROM `photos` WHERE (`photos`.photographer_id = 2) ORDER BY created_at DESC
---
  def viewer
    @photo = Photo.find(params[:id]) rescue nil